{
    "en" : {
        "translation" : {
            "home": "Home",
            "about": "About",
            "techstack": "Tech Stack",
            "projects": "Projects",
            "contacts": "Contacts",
            "intro_greeting": "Hi, my name is",
            "intro_role": "and I'm a junior frontend web developer!",
            "project_title": "Projects",
            "project_text": "Things I've done so far",
            "tech_title" : "My Tech Stack",
            "tech_text": "Technologies I learned and used during my classes",
            "about_title": "About Me",
            "about_text": "As a passionate student of Art History and Archaeology at the Université Libre de Bruxelles, I was able to acquire a wealth of experience in both creativity and work methodology. What's more, with my experience as a worker, I'm no stranger to teamwork. Today, having opened a door on my apprenticeship by joining the BeCode Charleroi team with its Junior Developer training since the end of August 2023, I'm looking for a 3-month internship starting in March 2024. With a thirst for learning, I'd like to build on my current knowledge of the frontend.",
            "work_title": "Work Experience",
            "education_title": "Education",
            "contact1": "You can contact me via",
            "contact2": "or via mail at",
            "contact3": "!",
            "build1": "Build by",
            "build2": "as a side project with",
            "build3": "and",
            "backpro": "Back to projects",
            "next": "Next",
            "back": "Back" 
        }
    },

    "fr" : {
        "translation" : {
            "home": "Acceuil",
            "about": "A propos",
            "techstack": "Tech Stack",
            "projects": "Projets",
            "contacts": "Contacts",
            "intro_greeting": "Bonjour, je m'appelle",
            "intro_role": "et je suis une développeuse web junior en frontend !",
            "project_title": "Projets",
            "project_text": "Ce que j'ai fait jusqu'à présent",
            "tech_title" : "Mon Tech Stack",
            "tech_text": "Technologies que j'ai appris et utilisés durant ma formation",
            "about_title": "A propos de moi",
            "about_text": "D’abord étudiante passionnée en Histoire de l’Art et Archéologie à l’Université Libre de Bruxelles, j’ai pu acquérir de nombreux bagages autant en créativité qu’en méthodologie de travail, soit une expérience précieuse qui m’a beaucoup apporté. De plus, forte de mon expérience en tant qu'agent de main de finition, le travail en équipe m'est familié. Aujourd’hui, après avoir ouvert une porte sur mon apprentissage en rejoignant l’équipe de BeCode Charleroi avec sa formation Junior Developer depuis fin août 2023, je suis à la recherche d'un stage d'une durée de 3 mois à partir de mars 2024. Ayant soif d’apprendre, je souhaite ancrer mes connaissances actuelles dans le domaine du frontend.",
            "work_title": "Expérience professionnelle",
            "education_title": "Education",
            "contact1": "Vous pouvez me contacter par",
            "contact2": "ou par mail à l'adresse",
            "contact3": "!",
            "build1": "Produit par",
            "build2": "en tant que projet parallèle avec",
            "build3": "et",
            "backpro": "Retour aux projets",
            "next": "Suivant",
            "back": "Précédent" 
        }
    
    }
}